app/Http/Controllers/TestController.php

	   public function showTable(Request $request){
 		//$id = $request->id;
 		//echo "Laravel	";

 		//dd($request->result);
 		//$a=$this->postRegister
 		$query= DB::table('school_details')->orderby('created_at','desc')->paginate(6);
---
select * from `school_details` order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `school_details`

	    public function editTable(Request $request){
 		$id = $request->id;

 		//echo "ddf:".$id;
 		$queryedit= DB::table('school_details')->where('id',$id)->get();
---
select * from `school_details` where `id` = '52'


        };

	    $id=DB::table('school_details')->where('id',$id)->update([
	    	'user_image'=>$details,
	    	'first_name'=>$fname,
	    	'last_name'=>$lname,
	    	'email'=>$emailid,
	    	'school_name'=>$schl_name,
	    	'school_rating'=>$schl_rating,
	    	 'updated_at' => \Carbon\Carbon::now(),  # \Datetime()
	    ]);
---
update `school_details` set `user_image` = '/storage/uploads/1551698585.jpg', `first_name` = 'Aishwariya', `last_name` = 'Naidu', `email` = 'aishwariyanaidu17@gmail.com', `school_name` = 'Xaviers', `school_rating` = '5', `updated_at` = '2019-03-04 11:23:05' where `id` = '4'